// 21. Дано число обозначающее день недели. Выяснить является номер дня недели выходным

// int day=6;
// 
// if (day==6 || day==7) System.Console.WriteLine("Выходной");
// else
    // if (day>=1 && day<=5) System.Console.WriteLine("Будний день");
        // else
            // System.Console.WriteLine("Введены неверные данные");

// 

// 25. Задать номер четверти, показать диапазоны для возможных координат

// 1. (x>0 and y>0)
// 2. (x<0 and y>0)
// 3. (x<0 and y<0)
// 4. (x>0 and y<0)

// int quarter=3;   //"Ручной" ввод
// int quarter=Convert.ToInt32(Console.ReadLine());    //Ввод с клавиатуры
// if (quarter==1) System.Console.WriteLine("x>0 and y>0");
// if (quarter==2) System.Console.WriteLine("x<0 and y>0");
// if (quarter==3) System.Console.WriteLine("x<0 and y<0");
// if (quarter==4) System.Console.WriteLine("x>0 and y<0");

// 

// 26. Программа проверяет пятизначное число на палиндромом. Например:12321


