// 8. Вывести на экран числа от -N до N

int i=-10;
int N=10;
while(i<=N)
{
    System.Console.WriteLine(i);
    i=i+1;
}